// 5. Дан прямоугольник, ширина которого в два раза меньше длины. 
// Найти площадь прямоугольника.

package by.training.simplestapp.main;

public class LinearApps1_05 {

	public static void main(String[] args) {
		
		int a = 3;        // длина прямоугольника 
		int s = a * 2 * a ;
		System.out.println(s);

	}

}
